src/AccumulationRegisters/ПотребностиЗаказовНаПроизводство/ПотребностиЗаказовНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиЗаказовНаПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВоспроизводства</name>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыВоспроизводстваНоменклатуры/ВидыВоспроизводстваНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВоспроизводстваНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Переработка</name>
  </enumValues>
  <enumValues>
    <name>ПринятыеВПереработку</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиОперативныйУчетОстатковНЗП</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПартионныйУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериямВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВоспроизводства</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Набор</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджерЗаПокупки</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнешняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнутренняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяУслуга</name>
    <comment>Является ли услуга транспортной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмеряетсяТолькоВСуммовомВыражении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаНДС</name>
    <comment>Льгота по НДС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыпуска</name>
    <type>
      <types>EnumRef.НаправленияВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеСписанияВыпущеннойПродукции</name>
    <type>
      <types>CatalogRef.НаправленияСписанияВыпущеннойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПрисвоенияСерийногоНомера</name>
    <type>
      <types>CatalogRef.ПорядокПрисвоенияСерийныхНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МертвыйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакИмпорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>АртикулыКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/AccumulationRegisters/ПотребностиЗаказовНаПроизводство/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Функция создает строку с сообщением о нехватке остатка при проведении
//
Функция СоздатьСтрокуСообщения(Обход)
	Стр = " - По документу: " + Обход.ДокКоличествоЕдиницыДокумента + " Потребность: " + Обход.КолОстатокЕдиницыДокумента + " Превышение: " + Обход.Нехватка +
		  " (Материал: """    + СокрЛП(Обход.НоменклатураПред)         + ?(Обход.НоменклатураВестиУчетПоХарактеристикам, """ Хар-ка материала: """ + СокрЛП(Обход.ХарактеристикаНоменклатурыПред), """") +
		  " Ед. изм: """      + СокрЛП(Обход.ЕдиницаИзмеренияПред)     + """" +
		  ?(НЕ ЗначениеЗаполнено(Обход.ВидВоспроизводства), "", " Вид воспроизводства: """ + СокрЛП(Обход.ВидВоспроизводстваПред)+ """") +
		  ?(НЕ ЗначениеЗаполнено(Обход.Продукция), "",
		  	" Продукция: """     + СокрЛП(Обход.ПродукцияПред) + """" +
		  		?(Обход.ПродукцияВестиУчетПоХарактеристикам, " Хар-ка продукции: """ + СокрЛП(Обход.ХарактеристикаПродукцииПред) + """", "")) + ")";
	Возврат Стр;
КонецФункции // СоздатьСтрокуСообщения()

// Процедура контролирует возможность списания потребности по заказам на производство из регистра
//
Процедура КонтрольОстатков(ДокОбъект, ИмяТабЧасти, ДопПараметры = Неопределено, Отказ, Заголовок, РежимПроведения) Экспорт
	
	Если РежимПроведения <> РежимПроведенияДокумента.Оперативный Тогда
		Возврат;
	КонецЕсли;
	
	МетаДок = ДокОбъект.Метаданные();
	
	ФлагКолМинус = Ложь;         // Определяет что количество из документа надо брать со знаком минус. (напр. док. КорректировкаЗаказаНаПроизводство)
	Заказ        = Неопределено; // Заказ на производство
	ТабИмяЗаказа = "";           // Имя колонки Заказ в табличной части
	
	МетаРеквизиты = МетаДок.ТабличныеЧасти[ИмяТабЧасти].Реквизиты;
	ЕстьПолеВидВоспроизводства = МетаРеквизиты.Найти("ВидВоспроизводства") <> Неопределено;
	ЕстьПолеПродукция          = МетаРеквизиты.Найти("Продукция")          <> Неопределено;
	
	Если ДопПараметры <> Неопределено Тогда
		Если ДопПараметры.Свойство("КоличествоСМинусом") Тогда
			ФлагКолМинус = ДопПараметры.КоличествоСМинусом;
		КонецЕсли;
		Если ДопПараметры.Свойство("ЗаказНаПроизводство") Тогда
			Заказ = ДопПараметры.ЗаказНаПроизводство;
		КонецЕсли;
		Если ДопПараметры.Свойство("ИмяКолонкиЗаказ") Тогда
			ТабИмяЗаказа = ДопПараметры.ИмяКолонкиЗаказ;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ТабИмяЗаказа) Тогда
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(Заказ);
	Иначе
		МассивЗаказов = ДокОбъект[ИмяТабЧасти].ВыгрузитьКолонку(ТабИмяЗаказа);
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДокРасходаПоЗаказу.ВидВоспроизводства,
		|	ПРЕДСТАВЛЕНИЕ(ДокРасходаПоЗаказу.ВидВоспроизводства) КАК ВидВоспроизводстваПред,
		|	ЕСТЬNULL(РегПотребности.КоличествоОстаток, 0) КАК КолОстаток,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(РегПотребности.КоличествоОстаток, 0)* ДокРасходаПоЗаказу.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ДокРасходаПоЗаказу.ЕдиницаИзмерения.Коэффициент КАК Число(15,3))
		|														КАК КолОстатокЕдиницыДокумента,
		|	ДокРасходаПоЗаказу.Номенклатура,
		|	ДокРасходаПоЗаказу.ХарактеристикаНоменклатуры,
		|	ДокРасходаПоЗаказу.Продукция,
		|	ДокРасходаПоЗаказу.ХарактеристикаПродукции,
		|	ДокРасходаПоЗаказу.ЕдиницаИзмерения,
		|	ДокРасходаПоЗаказу.Номенклатура.ВестиУчетПоХарактеристикам,
		|	ДокРасходаПоЗаказу.Продукция.ВестиУчетПоХарактеристикам,
		|	ПРЕДСТАВЛЕНИЕ(ДокРасходаПоЗаказу.Номенклатура) КАК НоменклатураПред,
		|	ПРЕДСТАВЛЕНИЕ(ДокРасходаПоЗаказу.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПред,
		|	ПРЕДСТАВЛЕНИЕ(ДокРасходаПоЗаказу.Продукция) КАК ПродукцияПред,
		|	ПРЕДСТАВЛЕНИЕ(ДокРасходаПоЗаказу.ХарактеристикаПродукции) КАК ХарактеристикаПродукцииПред,
		|	ПРЕДСТАВЛЕНИЕ(ДокРасходаПоЗаказу.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПред,
		|	ДокРасходаПоЗаказу.Количество КАК ДокКоличествоЕдиницыДокумента,
		|	ВЫРАЗИТЬ(ДокРасходаПоЗаказу.Количество * ДокРасходаПоЗаказу.ЕдиницаИзмерения.Коэффициент / ДокРасходаПоЗаказу.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Число(15,3))
		|														КАК ДокКоличество,
		|	ДокРасходаПоЗаказу.Количество - ВЫРАЗИТЬ(ЕСТЬNULL(РегПотребности.КоличествоОстаток, 0)* ДокРасходаПоЗаказу.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ДокРасходаПоЗаказу.ЕдиницаИзмерения.Коэффициент КАК Число(15,3))  
		|														КАК Нехватка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДокРасходаПоЗаказу.Номенклатура КАК Номенклатура,
		|		ДокРасходаПоЗаказу.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		" + ?(ЕстьПолеПродукция,
						"ДокРасходаПоЗаказу.Продукция КАК Продукция,
		|				 ДокРасходаПоЗаказу.ХарактеристикаПродукции КАК ХарактеристикаПродукции,",
						"&ПустНоменклатура КАК Продукция,
		|		 		 &ПустНоменклатура КАК ХарактеристикаПродукции,") + "
		|		" + ?(ЕстьПолеВидВоспроизводства, "ДокРасходаПоЗаказу.ВидВоспроизводства", "&ПустВидВоспроизводства") + " КАК ВидВоспроизводства,
		|		ДокРасходаПоЗаказу.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		" + ?(ФлагКолМинус, "-", "") + "СУММА(ДокРасходаПоЗаказу.Количество) КАК Количество
		|	ИЗ
		|	Документ." + МетаДок.Имя + "." + ИмяТабЧасти + " КАК ДокРасходаПоЗаказу
		|	ГДЕ
		|		ДокРасходаПоЗаказу.Ссылка = &ДокСсылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДокРасходаПоЗаказу.Номенклатура,
		|		ДокРасходаПоЗаказу.ХарактеристикаНоменклатуры,
		|		" + ?(ЕстьПолеПродукция, "ДокРасходаПоЗаказу.Продукция,
		|		ДокРасходаПоЗаказу.ХарактеристикаПродукции,", "") + "
		|		" + ?(ЕстьПолеВидВоспроизводства, "ДокРасходаПоЗаказу.ВидВоспроизводства,", "") + "
		|		ДокРасходаПоЗаказу.ЕдиницаИзмерения) КАК ДокРасходаПоЗаказу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностиЗаказовНаПроизводство.Остатки(, ЗаказНаПроизводство В(&МассивЗаказов)) КАК РегПотребности
		|		ПО ДокРасходаПоЗаказу.Номенклатура = РегПотребности.Номенклатура
		|			И ДокРасходаПоЗаказу.ХарактеристикаНоменклатуры = РегПотребности.ХарактеристикаНоменклатуры
		|			И ДокРасходаПоЗаказу.ЕдиницаИзмерения = РегПотребности.ЕдиницаИзмерения
		|			" + ?(ЕстьПолеПродукция, "И ДокРасходаПоЗаказу.Продукция = РегПотребности.Продукция
		|			И ДокРасходаПоЗаказу.ХарактеристикаПродукции = РегПотребности.ХарактеристикаПродукции", "") + "
		|			" + ?(ЕстьПолеВидВоспроизводства, "И ДокРасходаПоЗаказу.ВидВоспроизводства = РегПотребности.ВидВоспроизводства", "") + "
		|ГДЕ
		|	ДокРасходаПоЗаказу.Количество - ВЫРАЗИТЬ(ЕСТЬNULL(РегПотребности.КоличествоОстаток, 0)* ДокРасходаПоЗаказу.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ДокРасходаПоЗаказу.ЕдиницаИзмерения.Коэффициент КАК Число(15,3)) > 0";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("КонДата",       ДокОбъект.Дата);
	Запрос.УстановитьПараметр("ДокСсылка",     ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ПустВидВоспроизводства", Перечисления.ВидыВоспроизводстваНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустНоменклатура",       Справочники.Номенклатура.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		СтрОшибка = "Превышение потребности по заказу на производство: " + Заказ;
		Обход = РезультатЗапроса.Выбрать();
		Пока Обход.Следующий() Цикл
			СтрОшибка = СтрОшибка + Символы.ПС + СоздатьСтрокуСообщения(Обход);
		КонецЦикла;
		ОбщегоНазначения.СообщитьОбОшибке(СтрОшибка, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // КонтрольОстатков()
